**Data** is the most talked about topic in recent years. The world is increasingly generating more and more data every second. Tons of different types of data get generated - video, text, image, transaction, etc. And this is increasing exponentially with every year as the world is becoming more and more digital. Tools like **SQL** help us in getting meaningful insights out of this huge mountain of information.

In this **SQL project**, I have used 2 datasets namely **trans_dataset** which is a Sacramento Realestate Transactions dataset and **sales_dataset** which is JAN 2009 real estate sales dataset.
Using these two datasets I am going to demonstrate the following things.

    1. SELECT ALL 
    2. AGGREGATIONS (COUNT, SUM, AVG, MIN, MAX) 
    3. DISTINCT 
    4. CONDITIONS USING WHERE 
    5. LIMIT 
    6. LIKE 
    7. JOIN 
    8. AND / OR 
    9. NESTED QUERIES

In [2]:
pip install pandasql

Requirement already satisfied: pandasql in c:\users\rasto\appdata\local\programs\python\python39\lib\site-packages (0.7.3)
Requirement already satisfied: numpy in c:\users\rasto\appdata\local\programs\python\python39\lib\site-packages (from pandasql) (1.20.2)
Requirement already satisfied: pandas in c:\users\rasto\appdata\local\programs\python\python39\lib\site-packages (from pandasql) (1.2.3)
Requirement already satisfied: sqlalchemy in c:\users\rasto\appdata\local\programs\python\python39\lib\site-packages (from pandasql) (1.4.5)
Requirement already satisfied: pytz>=2017.3 in c:\users\rasto\appdata\local\programs\python\python39\lib\site-packages (from pandas->pandasql) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\rasto\appdata\local\programs\python\python39\lib\site-packages (from pandas->pandasql) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\rasto\appdata\local\programs\python\python39\lib\site-packages (from python-dateutil>=2.7.3->pandas->pandasql) (1.15.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\rasto\appdata\local\programs\python\python39\lib\site-packages (from sqlalchemy->pandasql) (1.0.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd 
import pandasql as ps

In [4]:
trans_dataset = pd.read_csv("D:\SQL\Sacramentorealestatetransactions.csv")
print(trans_dataset.shape)

(985, 12)

In [5]:
sales_dataset = pd.read_csv("D:\SQL\SalesJan2009.csv")
print(sales_dataset.shape)

(998, 13)

**SELECT ALL**

In [6]:
ps.sqldf("""

SELECT * FROM trans_dataset as df

""")

,street,city,zip,state,beds,baths,sq__ft,type,sale_date,price,latitude,longitude
0,3526 HIGH ST,SACRAMENTO,95838,CA,2,1,836,Residential,Wed May 21 00:00:00 EDT 2008,59222,38.631913,-121.434879
1,51 OMAHA CT,SACRAMENTO,95823,CA,3,1,1167,Residential,Wed May 21 00:00:00 EDT 2008,68212,38.478902,-121.431028
2,2796 BRANCH ST,SACRAMENTO,95815,CA,2,1,796,Residential,Wed May 21 00:00:00 EDT 2008,68880,38.618305,-121.443839
3,2805 JANETTE WAY,SACRAMENTO,95815,CA,2,1,852,Residential,Wed May 21 00:00:00 EDT 2008,69307,38.616835,-121.439146
4,6001 MCMAHON DR,SACRAMENTO,95824,CA,2,1,797,Residential,Wed May 21 00:00:00 EDT 2008,81900,38.519470,-121.435768
...,...,...,...,...,...,...,...,...,...,...,...,...
980,9169 GARLINGTON CT,SACRAMENTO,95829,CA,4,3,2280,Residential,Thu May 15 00:00:00 EDT 2008,232425,38.457679,-121.359620
981,6932 RUSKUT WAY,SACRAMENTO,95823,CA,3,2,1477,Residential,Thu May 15 00:00:00 EDT 2008,234000,38.499893,-121.458890
982,7933 DAFFODIL WAY,CITRUS HEIGHTS,95610,CA,3,2,1216,Residential,Thu May 15 00:00:00 EDT 2008,235000,38.708824,-121.256803
983,8304 RED FOX WAY,ELK GROVE,95758,CA,4,2,1685,Residential,Thu May 15 00:00:00 EDT 2008,235301,38.417000,-121.397424
984,3882 YELLOWSTONE LN,EL DORADO HILLS,95762,CA,3,2,1362,Residential,Thu May 15 00:00:00 EDT 2008,235738,38.655245,-121.075915

In [7]:
ps.sqldf("""

    SELECT * FROM sales_dataset as ds

""")

,Transaction_date,Product,Price,Payment_Type,Name,City,State,Country,Account_Created,Last_Login,Latitude,Longitude,US Zip
0,01/02/2009 04:53,Product1,1200,Visa,Betina,Parkville,MO,United States,1/2/2009 04:42,1/2/2009 07:49,39.195000,-94.681940,64152.0
1,01/02/2009 13:08,Product1,1200,Mastercard,Federica e Andrea,Astoria,OR,United States,1/1/2009 16:21,1/3/2009 12:32,46.188060,-123.830000,97103.0
2,01/04/2009 12:56,Product2,3600,Visa,Gerd W,Cahaba Heights,AL,United States,11/15/08 15:47,1/4/2009 12:45,33.520560,-86.802500,35243.0
3,01/04/2009 13:19,Product1,1200,Visa,LAURENCE,Mickleton,NJ,United States,9/24/08 15:19,1/4/2009 13:04,39.790000,-75.238060,8056.0
4,01/04/2009 20:11,Product1,1200,Mastercard,Fleur,Peoria,IL,United States,1/3/2009 09:38,1/4/2009 19:45,40.693610,-89.588890,61601.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
993,01/02/2009 17:24,Product2,3600,Diners,clara,Perth,Western Australia,Australia,1/1/2009 21:20,2/27/2009 18:43,-31.933333,115.833333,NaN
994,01/04/2009 18:57,Product1,1200,Mastercard,KELI,Worongary,Queensland,Australia,12/23/08 15:17,2/28/2009 14:00,-28.050000,153.350000,NaN
995,01/23/2009 12:42,Product2,3600,Mastercard,Anke,Avalon,New South Wales,Australia,3/3/08 17:38,2/28/2009 22:26,-33.633333,151.333333,NaN
996,01/07/2009 19:48,Product2,3600,Mastercard,TRICIA,Sydney,New South Wales,Australia,9/21/08 20:49,3/1/2009 00:14,-33.883333,151.216667,NaN
997,01/25/2009 05:57,Product1,1200,Amex,pamela,Ayacucho,Buenos Aires,Argentina,1/24/2009 09:29,2/10/2009 06:38,-37.150000,-58.483333,NaN

**AGGREGATIONS (COUNT, SUM, AVG, MIN, MAX)**

In [8]:
ps.sqldf("""

    SELECT count(zip) FROM trans_dataset as df

""")

   count(zip)
0         985

In [9]:
ps.sqldf("""

    SELECT SUM(price) FROM trans_dataset as df

""")

   SUM(price)
0   230632100

In [10]:
ps.sqldf("""

    SELECT AVG(price) FROM trans_dataset as df
    WHERE beds = 2

""")

      AVG(price)
0  165428.300752

**DISTINCT**

In [11]:
ps.sqldf("""

    SELECT DISTINCT city FROM trans_dataset as df
    LIMIT 10

""")

              city
0       SACRAMENTO
1   RANCHO CORDOVA
2        RIO LINDA
3   CITRUS HEIGHTS
4  NORTH HIGHLANDS
5         ANTELOPE
6        ELK GROVE
7          ELVERTA
8             GALT
9       CARMICHAEL

**LIMIT AND WHERE**

In [12]:
ps.sqldf("""

    SELECT * FROM trans_dataset as df
    WHERE price < 10000
    LIMIT 5

""")

,street,city,zip,state,beds,baths,sq__ft,type,sale_date,price,latitude,longitude
0,20 CRYSTALWOOD CIR,LINCOLN,95648,CA,0,0,0,Residential,Mon May 19 00:00:00 EDT 2008,4897,38.885327,-121.289412
1,24 CRYSTALWOOD CIR,LINCOLN,95648,CA,0,0,0,Residential,Mon May 19 00:00:00 EDT 2008,4897,38.885132,-121.289405
2,28 CRYSTALWOOD CIR,LINCOLN,95648,CA,0,0,0,Residential,Mon May 19 00:00:00 EDT 2008,4897,38.884936,-121.289397
3,32 CRYSTALWOOD CIR,LINCOLN,95648,CA,0,0,0,Residential,Mon May 19 00:00:00 EDT 2008,4897,38.884741,-121.289390
4,36 CRYSTALWOOD CIR,LINCOLN,95648,CA,0,0,0,Residential,Mon May 19 00:00:00 EDT 2008,4897,38.884599,-121.289406

In [13]:
ps.sqldf("""

    SELECT * FROM trans_dataset 
    WHERE beds = 2
    LIMIT 5

""")

,street,city,zip,state,beds,baths,sq__ft,type,sale_date,price,latitude,longitude
0,3526 HIGH ST,SACRAMENTO,95838,CA,2,1,836,Residential,Wed May 21 00:00:00 EDT 2008,59222,38.631913,-121.434879
1,2796 BRANCH ST,SACRAMENTO,95815,CA,2,1,796,Residential,Wed May 21 00:00:00 EDT 2008,68880,38.618305,-121.443839
2,2805 JANETTE WAY,SACRAMENTO,95815,CA,2,1,852,Residential,Wed May 21 00:00:00 EDT 2008,69307,38.616835,-121.439146
3,6001 MCMAHON DR,SACRAMENTO,95824,CA,2,1,797,Residential,Wed May 21 00:00:00 EDT 2008,81900,38.519470,-121.435768
4,11150 TRINITY RIVER DR Unit 114,RANCHO CORDOVA,95670,CA,2,2,941,Condo,Wed May 21 00:00:00 EDT 2008,94905,38.621188,-121.270555

**WILD CARD (LIKE)**

In [14]:
ps.sqldf("""

    SELECT * FROM trans_dataset 
    WHERE city LIKE '%sac%'

""")

,street,city,zip,state,beds,baths,sq__ft,type,sale_date,price,latitude,longitude
0,3526 HIGH ST,SACRAMENTO,95838,CA,2,1,836,Residential,Wed May 21 00:00:00 EDT 2008,59222,38.631913,-121.434879
1,51 OMAHA CT,SACRAMENTO,95823,CA,3,1,1167,Residential,Wed May 21 00:00:00 EDT 2008,68212,38.478902,-121.431028
2,2796 BRANCH ST,SACRAMENTO,95815,CA,2,1,796,Residential,Wed May 21 00:00:00 EDT 2008,68880,38.618305,-121.443839
3,2805 JANETTE WAY,SACRAMENTO,95815,CA,2,1,852,Residential,Wed May 21 00:00:00 EDT 2008,69307,38.616835,-121.439146
4,6001 MCMAHON DR,SACRAMENTO,95824,CA,2,1,797,Residential,Wed May 21 00:00:00 EDT 2008,81900,38.519470,-121.435768
...,...,...,...,...,...,...,...,...,...,...,...,...
437,3528 SAINT GEORGE DR,SACRAMENTO,95821,CA,3,1,1040,Residential,Thu May 15 00:00:00 EDT 2008,224000,38.629468,-121.376445
438,5 BISHOPGATE CT,SACRAMENTO,95823,CA,4,2,1329,Residential,Thu May 15 00:00:00 EDT 2008,229500,38.467936,-121.445477
439,5601 REXLEIGH DR,SACRAMENTO,95823,CA,4,2,1715,Residential,Thu May 15 00:00:00 EDT 2008,230000,38.445342,-121.441504
440,9169 GARLINGTON CT,SACRAMENTO,95829,CA,4,3,2280,Residential,Thu May 15 00:00:00 EDT 2008,232425,38.457679,-121.359620
441,6932 RUSKUT WAY,SACRAMENTO,95823,CA,3,2,1477,Residential,Thu May 15 00:00:00 EDT 2008,234000,38.499893,-121.458890

In [15]:
ps.sqldf("""

    SELECT * FROM trans_dataset as df
    WHERE street LIKE '%ST%'
    LIMIT 5

""")

,street,city,zip,state,beds,baths,sq__ft,type,sale_date,price,latitude,longitude
0,3526 HIGH ST,SACRAMENTO,95838,CA,2,1,836,Residential,Wed May 21 00:00:00 EDT 2008,59222,38.631913,-121.434879
1,2796 BRANCH ST,SACRAMENTO,95815,CA,2,1,796,Residential,Wed May 21 00:00:00 EDT 2008,68880,38.618305,-121.443839
2,7325 10TH ST,RIO LINDA,95673,CA,3,2,1146,Residential,Wed May 21 00:00:00 EDT 2008,98937,38.700909,-121.442979
3,6715 6TH ST,RIO LINDA,95673,CA,2,1,844,Residential,Wed May 21 00:00:00 EDT 2008,113263,38.689591,-121.452239
4,6118 STONEHAND AVE,CITRUS HEIGHTS,95621,CA,3,2,1118,Residential,Wed May 21 00:00:00 EDT 2008,122000,38.707851,-121.320707

**JOIN**

In [16]:
ps.sqldf("""

    SELECT df.street, df.city, df.price, ds.price FROM trans_dataset as df
    JOIN
    sales_dataset as ds
    WHERE df.price > 1000


""")

                     street             city   price  Price
0              3526 HIGH ST       SACRAMENTO   59222   1200
1              3526 HIGH ST       SACRAMENTO   59222   1200
2              3526 HIGH ST       SACRAMENTO   59222   3600
3              3526 HIGH ST       SACRAMENTO   59222   1200
4              3526 HIGH ST       SACRAMENTO   59222   1200
...                     ...              ...     ...    ...
983025  3882 YELLOWSTONE LN  EL DORADO HILLS  235738   3600
983026  3882 YELLOWSTONE LN  EL DORADO HILLS  235738   1200
983027  3882 YELLOWSTONE LN  EL DORADO HILLS  235738   3600
983028  3882 YELLOWSTONE LN  EL DORADO HILLS  235738   3600
983029  3882 YELLOWSTONE LN  EL DORADO HILLS  235738   1200

[983030 rows x 4 columns]

In [17]:
ps.sqldf("""

    SELECT df.city, df.zip, df.sale_date, ds.price, ds.name FROM trans_dataset as df
    LEFT JOIN
    sales_dataset as ds
    LIMIT 10

""")

         city    zip                     sale_date  Price               Name
0  SACRAMENTO  95838  Wed May 21 00:00:00 EDT 2008   1200             Betina
1  SACRAMENTO  95838  Wed May 21 00:00:00 EDT 2008   1200  Federica e Andrea
2  SACRAMENTO  95838  Wed May 21 00:00:00 EDT 2008   3600             Gerd W
3  SACRAMENTO  95838  Wed May 21 00:00:00 EDT 2008   1200           LAURENCE
4  SACRAMENTO  95838  Wed May 21 00:00:00 EDT 2008   1200              Fleur
5  SACRAMENTO  95838  Wed May 21 00:00:00 EDT 2008   1200               adam
6  SACRAMENTO  95838  Wed May 21 00:00:00 EDT 2008   1200              Stacy
7  SACRAMENTO  95838  Wed May 21 00:00:00 EDT 2008   1200               Sean
8  SACRAMENTO  95838  Wed May 21 00:00:00 EDT 2008   1200            Georgia
9  SACRAMENTO  95838  Wed May 21 00:00:00 EDT 2008   1200            Richard

In [18]:
ps.sqldf("""

    SELECT * FROM trans_dataset as df
    JOIN
    sales_dataset as ds
    where ds.state = df.state

""")

,street,city,zip,state,beds,baths,sq__ft,type,sale_date,price,...,Payment_Type,Name,City,State,Country,Account_Created,Last_Login,Latitude,Longitude,US Zip
0,3526 HIGH ST,SACRAMENTO,95838,CA,2,1,836,Residential,Wed May 21 00:00:00 EDT 2008,59222,...,Mastercard,Barbara,La Crescenta,CA,United States,12/31/08 17:51,2/2/2009 10:27,34.22417,-118.23917,91214.0
1,3526 HIGH ST,SACRAMENTO,95838,CA,2,1,836,Residential,Wed May 21 00:00:00 EDT 2008,59222,...,Amex,Andrea,San Mateo,CA,United States,12/31/08 17:09,2/6/2009 21:59,37.56306,-122.32444,94401.0
2,3526 HIGH ST,SACRAMENTO,95838,CA,2,1,836,Residential,Wed May 21 00:00:00 EDT 2008,59222,...,Diners,caterina,Burbank,CA,United States,12/30/08 8:39,2/26/2009 20:22,34.18083,-118.30806,91502.0
3,3526 HIGH ST,SACRAMENTO,95838,CA,2,1,836,Residential,Wed May 21 00:00:00 EDT 2008,59222,...,Visa,Cindy,Glendora,CA,United States,3/13/04 14:09,2/14/2009 11:23,34.13611,-117.86444,91741.0
4,3526 HIGH ST,SACRAMENTO,95838,CA,2,1,836,Residential,Wed May 21 00:00:00 EDT 2008,59222,...,Visa,Doug and Tina,Pls Vrds Est,CA,United States,12/24/07 22:59,2/27/2009 21:40,33.80056,-118.38917,90274.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
65005,3882 YELLOWSTONE LN,EL DORADO HILLS,95762,CA,3,2,1362,Residential,Thu May 15 00:00:00 EDT 2008,235738,...,Visa,John,San Jose,CA,United States,1/14/04 21:59,2/10/2009 23:58,37.33944,-121.89389,95113.0
65006,3882 YELLOWSTONE LN,EL DORADO HILLS,95762,CA,3,2,1362,Residential,Thu May 15 00:00:00 EDT 2008,235738,...,Visa,KERRY,Sunnyvale,CA,United States,1/29/2009 14:04,1/29/2009 14:04,37.36889,-122.03528,94086.0
65007,3882 YELLOWSTONE LN,EL DORADO HILLS,95762,CA,3,2,1362,Residential,Thu May 15 00:00:00 EDT 2008,235738,...,Visa,Tabatha,Altadena,CA,United States,12/28/08 14:42,2/3/2009 18:09,34.18972,-118.13028,91001.0
65008,3882 YELLOWSTONE LN,EL DORADO HILLS,95762,CA,3,2,1362,Residential,Thu May 15 00:00:00 EDT 2008,235738,...,Mastercard,Abikay,Fullerton,CA,United States,1/26/2009 13:34,2/9/2009 12:53,33.87028,-117.92444,92832.0
65009,3882 YELLOWSTONE LN,EL DORADO HILLS,95762,CA,3,2,1362,Residential,Thu May 15 00:00:00 EDT 2008,235738,...,Mastercard,Natasha,Pasadena,CA,United States,1/30/2009 20:02,2/3/2009 23:39,34.14778,-118.14361,91101.0

In [19]:
ps.sqldf("""

    SELECT df.city,
    AVG(df.price) as avg_price, 
    SUM(df.sq__ft) as avg_sqft,
    MIN(ds.account_created) as min_account_created,
    MAX(df.zip) as max_zip

    FROM trans_dataset as df
    JOIN
    sales_dataset as ds

""")

         city      avg_price    avg_sqft min_account_created  max_zip
0  SACRAMENTO  234144.263959  1292602614         1/1/05 6:03    95864

**AND / OR**

In [20]:
ps.sqldf("""

    SELECT df.street, df.price, ds.name, ds.account_created FROM trans_dataset as df
    JOIN
    sales_dataset as ds
    WHERE (df.price >60000 AND ds.price = 1200)

""")

                     street   price                Name  Account_Created
0               51 OMAHA CT   68212                   A     11/8/08 4:07
1               51 OMAHA CT   68212                 AMY   12/30/08 20:41
2               51 OMAHA CT   68212               Aaron   11/16/08 15:49
3               51 OMAHA CT   68212              Abikay  1/26/2009 13:34
4               51 OMAHA CT   68212              Abikay   10/27/08 14:16
...                     ...     ...                 ...              ...
778761  3882 YELLOWSTONE LN  235738               stacy     3/5/06 15:01
778762  3882 YELLOWSTONE LN  235738               steve  1/12/2009 07:47
778763  3882 YELLOWSTONE LN  235738               sunny    9/14/05 22:53
778764  3882 YELLOWSTONE LN  235738             suzanne   1/9/2009 19:15
778765  3882 YELLOWSTONE LN  235738  valerie et nicolas   1/8/2009 05:31

[778766 rows x 4 columns]

In [21]:
ps.sqldf("""

    SELECT df.street, df.city, ds.name, ds.state FROM trans_dataset as df
    JOIN 
    sales_dataset as ds
    WHERE (df.city = 'CA' AND df.price >60000)
    OR
    (ds.city <> 'CA' AND ds.price =3600)

""")

,street,city,Name,State
0,3526 HIGH ST,SACRAMENTO,Gerd W,AL
1,3526 HIGH ST,SACRAMENTO,Ritz,VT
2,3526 HIGH ST,SACRAMENTO,Sylvia,VT
3,3526 HIGH ST,SACRAMENTO,Anabela,IL
4,3526 HIGH ST,SACRAMENTO,Christiane,FL
...,...,...,...,...
133955,3882 YELLOWSTONE LN,EL DORADO HILLS,Kees en Valesca,Tasmania
133956,3882 YELLOWSTONE LN,EL DORADO HILLS,Piret,Western Australia
133957,3882 YELLOWSTONE LN,EL DORADO HILLS,clara,Western Australia
133958,3882 YELLOWSTONE LN,EL DORADO HILLS,Anke,New South Wales
133959,3882 YELLOWSTONE LN,EL DORADO HILLS,TRICIA,New South Wales

**NESTED QUERIES**

In [22]:
ps.sqldf("""

    SELECT ds.name, ds.price FROM sales_dataset as ds
    WHERE ds.state IN(
        SELECT df.state FROM trans_dataset as df
        WHERE price > 60000
        )

""")

                    Name  Price
0                 asuman   1200
1                 Family   1200
2               Delphine   1200
3                  Valda   3600
4                  CLARE   1200
..                   ...    ...
61                 Angie   1200
62              caterina   1200
63  Frank and Christelle   7500
64         Doug and Tina   1200
65                 Kevin   1200

[66 rows x 2 columns]

**Thank your for viewing this project till the end.**

**Follow me on LinkedIn** >   https://www.linkedin.com/shubhamrastogi98

**Follow me on Github**   >   https://www.github.com/wokeshubham